---
title: ClassificationEntry
classe: Autodesk.Revit.DB.ClassificationEntry
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.KeyBasedTreeEntry
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ClassificationEntry

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CategoryId { get; }` | `classificationEntry.CategoryId` | ElementId |
| `String Description { get; }` | `classificationEntry.Description` | String |
| `Int32 Level { get; }` | `classificationEntry.Level` | Int32 |
| `Boolean HasBadCategoryId()` | `classificationEntry.HasBadCategoryId()` | Boolean |
| `Boolean HasBadLevel()` | `classificationEntry.HasBadLevel()` | Boolean |
| `Boolean HasInvalidKey()` | `classificationEntry.HasInvalidKey()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```